// ignore_for_file: non_constant_identifier_names

class KalimasData {

  List<String> kalimaTitleEng = [
    'Tayyab',
    'Shahaadat',
    'Tumjeed',
    'Tauhid',
    'Istaghfar',
    'Rud-A-Kuffer',
  ];

  List<String> kalimaTitleArabic = [
    'طیب',
    'شہادت',
    'تمجید',
    'توحید',
    'استغفار',
    'ردِکفر',
  ];

  List<String> kalimaMean = [
    'Purity',
    'Testimony ',
    'Glorification',
    'Unity',
    'Penitence',
    'Rejecting disbelief',
  ];



  List<String> KalimasArabic = [
    "لَا إِلَٰهَ إِلَّا ٱللَّٰهُ مُحَمَّدٌ رَسُولُ ٱللَّٰهِ",
    "اَشْهَدُ اَنْ لَّآ اِلٰهَ اِلَّا اللهُ وَحْدَہٗ لَاشَرِيْكَ لَہٗ وَاَشْهَدُ اَنَّ مُحَمَّدًا عَبْدُهٗ وَرَسُولُہٗ",
    "سُبْحَان اللهِ وَالْحَمْدُلِلّهِ وَلا إِلهَ إِلّااللّهُ وَاللّهُ أكْبَرُ وَلا حَوْلَ وَلاَ قُوَّةَ إِلَّا بِاللّهِ الْعَلِيِّ الْعَظِيْم",
    "لَآ اِلٰهَ اِلَّا اللهُ وَحْدَهٗ لَا شَرِيْكَ لَهٗ لَهُ الْمُلْكُ وَ لَهُ الْحَمْدُ يُحْىٖ وَ يُمِيْتُ وَ هُوَحَیٌّ لَّا يَمُوْتُ اَبَدًا اَبَدًاؕ ذُو الْجَلَالِ وَالْاِكْرَامِؕ بِيَدِهِ الْخَيْرُؕ وَهُوَ عَلٰى كُلِّ شیْ ٍٔ قَدِیْرٌؕ",
    "اَسْتَغْفِرُ اللهِ رَبِّىْ مِنْ كُلِِّ ذَنْۢبٍ اَذْنَبْتُهٗ عَمَدًا اَوْ خَطَا ًٔ سِرًّا اَوْ عَلَانِيَةً وَّاَتُوْبُ اِلَيْهِ مِنَ الذَّنْۢبِ الَّذِیْٓ اَعْلَمُ وَ مِنَ الذَّنْۢبِ الَّذِىْ لَآ اَعْلَمُ اِنَّكَ اَنْتَ عَلَّامُ الْغُيُوْبِ وَ سَتَّارُ الْعُيُوْبِ و َغَفَّارُ الذُّنُوْبِ وَ لَا حَوْلَ وَلَا قُوَّةَ اِلَّا بِاللهِ الْعَلِىِِّ الْعَظِيْمِؕ",
    "اَللّٰهُمَّ اِنِّیْٓ اَعُوْذُ بِكَ مِنْ اَنْ اُشْرِكَ بِكَ شَيْئًا وَّاَنَآ اَعْلَمُ بِهٖ وَ اَسْتَغْفِرُكَ لِمَا لَآ اَعْلَمُ بِهٖ تُبْتُ عَنْهُ وَ تَبَرَّأْتُ مِنَ الْكُفْرِ وَ الشِّرْكِ وَ الْكِذْبِ وَ الْغِيْبَةِ وَ الْبِدْعَةِ وَ النَّمِيْمَةِ وَ الْفَوَاحِشِ وَ الْبُهْتَانِ وَ الْمَعَاصِىْ كُلِِّهَا وَ اَسْلَمْتُ وَ اَقُوْلُ لَآ اِلٰهَ اِلَّا اللهُ مُحَمَّدٌ رَّسُوْلُ اللهِؕ",
  ];

  List<String> KalimasUrdu = [
    "اللہ کے سوا کوئی معبود نہیں محمّدؐ اللہ کے رسول ہیں",
    "میں گواہی دیتا ہوں کہ اللہ کے سوا کوئی معبود نہیں وہ اکیلا ہے، اسکا کوئی شریک نہیں اور میں گواہی دیتا ہو کہ محمد ﷺ اللہ  کے بندے اور رسول ہیں",
    "اللہ کی ذات پاک ہے اور سب تعریفیں اللہ کیلئے ہیں اور اللہ کے سوا کوئی معبود نہیں اور اللہ بہت بڑا ہے، گناہوں سے بچنے کی طاقت اور نیک کام کرنے کی توفیق نہیں مگر کی جانب سے جو بہت بلند اور عظمت والا ہے۔",
    "اللہ کے سوا کوئی معبود نہیں وہ اکیلا ہے اسکا کوئی شریک نہیں، اسی کی بادشاہی ہے اور اس کے لیے تمام تعریفیں ہیں۔ وہ زندہ کرتا ہے اور وہ مارتا ہے۔ اور وہ ہمیشہ کیلئے زندہ ہے وہ مرے گا نہیں۔ عظمت اور بزرگی والا ہے ، بہتری اسی کے ہاتھ میں ہے اور ہر چیز پر قادر ہے",
    "معافی مانگتا ہوں اے میرے اللہ ہر گناہ سے جو میں نے جان بوجھ کر کیا یا بھول کر کیا ہے، در پردہ یا کھلم کھلا اور میں توبہ کرتا ہوں اسکے حضور میں اس گناہ سے جو مجھے معلوم ہے اور اس گناہ سے جو مجھے معلوم نہیں، بے شک تو عیبوں کو جاننے والا اور عیبوں کو چھپانے والا ہے، اور گناہوں سے بخشنے والا ہے اور گناہوں سے بچنے کی طاقت اور نیک کام کرنے کی طاقت اللہ ہی کی طرف سے ہے۔ جو عالی شان اور عظمت والا ہے",
    "اے اللہ میں پناہ مانگتا ہوں اس بات سے کہ میں کسی شے کو تیرا شریک بناؤں جان بوجھ کر، اور بخشش مانگتا ہوں میں تم سے اس کام کی جو میں جانتا نہیں ہوں اور میں نے اس سے توبہ کیا اور بیزار ہوا اور کفر سے اور شرک سے، اور جھوٹ سے، اور غیبت سے، اور بدعت سے ، اور چغلی سے ، اور بے حیائی سے، اور بہتان سے اور تمام گناہوں سے اور میں اسلام لایا اور میں کہتا ہوں کہ اللہ کے سوا کوئی معبود نہیں اور محمد ﷺ اللہ کے رسول ہیں",
  ];

}